# Generated by Django 4.2.2 on 2024-06-02 05:15

from pickle import FALSE, TRUE
from django.contrib.auth.models import User
from django.contrib.auth.models import Group

from django.db import migrations
# Подключаем модуль для работы с датой/веременем
from datetime import datetime, timedelta
# Подключаем модкль генерации случайных чисел
import random

# Найти или Добавить Категорию
global dict_category
dict_category = {}

def get_category(apps, val):   
    # Поиск категории
    if val in dict_category.values():
        for k, v in dict_category.items():
            if v == val:
                return k    
    else:
        Category = apps.get_model("product", "Category")
        category = Category()
        category.category_title = val
        category.save()
        dict_category[category.id] = category.category_title
        return category.id

# Добавить товар 
def insert_catalog(apps, param_catalog):   
    Catalog = apps.get_model("product", "Catalog")
    catalog = Catalog()
    catalog.category_id = param_catalog[0]
    catalog.catalog_title = param_catalog[1]
    catalog.details = param_catalog[2]
    catalog.price = param_catalog[3]
    catalog.photo = param_catalog[4]
    catalog.save()
    return

# Добавить отзыв на товар 
def insert_review(apps, param_review):   
    Review = apps.get_model("product", "Review")
    review = Review()
    review.date_review = param_review[0]
    review.catalog_id = param_review[1]
    review.user_id = param_review[2]
    review.rating = param_review[3]
    review.details = param_review[4]
    review.save()
    review.date_review = param_review[0]
    review.save()
    return

# Добавить Вопросы и ответы 
def insert_question(apps, param_question):   
    Question = apps.get_model("product", "Question")
    question = Question()
    question.date_question = param_question[0]
    question.catalog_id = param_question[1]
    question.user_id = param_question[2]
    question.question = param_question[3]
    question.answer = param_question[4]
    question.save()
    question.date_question = param_question[0]
    question.save()
    return

# Добавить Новости
def insert_news(apps, param):
    News = apps.get_model("product", "News")
    news = News()
    news.daten = param[0]
    news.news_title = param[1]
    news.details = param[2]
    news.photo = param[3]
    news.save()
    return 

# Начальные данные 
def new_data(apps, schema_editor):
    try:
        # Суперпользователь id=1
        user = User.objects.create_superuser(username='root',
        email='shop120424@mail.ru',
        first_name='Руслан', 
        last_name='Кусаинов',
        password='SsNn5678+-@')
        print("Суперпользователь создан")
    
        # Группа менеджеров
        managers = Group.objects.get_or_create(name = 'Managers')
        managers = Group.objects.get(name='Managers')
        print("Группа менеджеров создана")
    
        # Пользователь с ролью менеджера id=2
        user = User.objects.create_user(username='manager', password='Ss0066+-', email='manager@mail.ru', first_name='Вадим', last_name='Куляев')
        managers.user_set.add(user)
        print("Менеджер добавлен в группу менеджеров")

        # Простые пользователи () id3-22
        user = User.objects.create_user(username='user1', password='Uu0066+-', email='user1@mail.ru', first_name='Динара', last_name='Махан')
        user = User.objects.create_user(username='user2', password='Uu0066+-', email='user2@mail.ru', first_name='Алтыншаш ', last_name='Бабашева')
        user = User.objects.create_user(username='user3', password='Uu0066+-', email='user3@mail.ru', first_name='Айман', last_name='Жалғасбаева')
        user = User.objects.create_user(username='user4', password='Uu0066+-', email='user4@mail.ru', first_name='Амир', last_name='Дандамаев')
        user = User.objects.create_user(username='user5', password='Uu0066+-', email='user5@mail.ru', first_name='Самат', last_name='Жұмабек')
        user = User.objects.create_user(username='user6', password='Uu0066+-', email='user6@mail.ru', first_name='Камалбек', last_name='Көшербаев')
        user = User.objects.create_user(username='user7', password='Uu0066+-', email='user7@mail.ru', first_name='Альбина', last_name='Алангузова')
        user = User.objects.create_user(username='user8', password='Uu0066+-', email='user8@mail.ru', first_name='Жанел', last_name='Кабдуллина')
        user = User.objects.create_user(username='user9', password='Uu0066+-', email='user9@mail.ru', first_name='Арман', last_name='Қайратов')
        user = User.objects.create_user(username='user10', password='Uu0066+-', email='user10@mail.ru', first_name='Айдана ', last_name='Ермекова')        
        user = User.objects.create_user(username='user11', password='Uu0066+-', email='user11@mail.ru', first_name='Күлайым', last_name='Бекмырза')
        user = User.objects.create_user(username='user12', password='Uu0066+-', email='user12@mail.ru', first_name='Альбина', last_name='Ашимтаева')
        user = User.objects.create_user(username='user13', password='Uu0066+-', email='user13@mail.ru', first_name='Диас', last_name='Аубакиров')
        user = User.objects.create_user(username='user14', password='Uu0066+-', email='user14@mail.ru', first_name='Юрий', last_name='Морхов')
        user = User.objects.create_user(username='user15', password='Uu0066+-', email='user15@mail.ru', first_name='Виктор', last_name='Гарнов')
        user = User.objects.create_user(username='user16', password='Uu0066+-', email='user16@mail.ru', first_name='Дамира', last_name='Токубаева')
        user = User.objects.create_user(username='user17', password='Uu0066+-', email='user17@mail.ru', first_name='Ержан', last_name='Дүйсенғалиев')
        user = User.objects.create_user(username='user18', password='Uu0066+-', email='user18@mail.ru', first_name='Ксения', last_name='Воробьева')
        user = User.objects.create_user(username='user19', password='Uu0066+-', email='user19@mail.ru', first_name='Жибек', last_name='Исаханова')
        user = User.objects.create_user(username='user20', password='Uu0066+-', email='user20@mail.ru', first_name='Сабит', last_name='Кабиден')        
        print("Созданы простые пользователи")

        ##1 Каталог parameters - товар, (категория, название, описание, цена, фото)
        #parameters = [get_category(apps, "Категория"), "Название", """Описание""", 2000, "images/catalog01.jpg"]		
        #insert_catalog(apps, parameters)   
        #parameters = [datetime.now() - timedelta(days=30) + timedelta(minutes=random.randint(1, 240)), 1, 3, 5, "Отзыв"]		
        #insert_review(apps, parameters) 
        #parameters = [datetime.now() - timedelta(days=29) + timedelta(minutes=random.randint(1, 240)), 34, 11, "Вопрос", "Ответ"]		
        #insert_question(apps, parameters) 

        #1 Каталог parameters - товар, (категория, название, описание, цена, фото)
        parameters = [get_category(apps, "Салаты"), "Куриное пате на хлебе тартин", """Пате из курицы, хлеб тартин ,томат конфи, сыр пармезан, масло оливковое, перец черный.""", 2250, "images/catalog01.jpg"]		
        insert_catalog(apps, parameters)   
        parameters = [datetime.now() - timedelta(days=30) + timedelta(minutes=random.randint(1, 240)), 1, 3, 5, "Отличное блюдо"]		
        insert_review(apps, parameters) 
        #parameters = [datetime.now() - timedelta(days=29) + timedelta(minutes=random.randint(1, 240)), 1, 4, "Вопрос", "Ответ"]		
        #insert_question(apps, parameters) 

        #2 Каталог parameters - товар, (категория, название, описание, цена, фото)
        parameters = [get_category(apps, "Салаты"), "Салат халуми", """Сыр Халуми, инжир, морковь, свекла, руккола, лист салата, лук красный, сыр пармезан, бальзамик, ...""", 3750, "images/catalog02.jpg"]		
        insert_catalog(apps, parameters)   
        parameters = [datetime.now() - timedelta(days=29) + timedelta(minutes=random.randint(1, 240)), 2, 4, 5, "Спасибо все было очень вкусно"]		
        insert_review(apps, parameters) 
        #parameters = [datetime.now() - timedelta(days=28) + timedelta(minutes=random.randint(1, 240)), 2, 5, "Вопрос", "Ответ"]		
        #insert_question(apps, parameters) 

        #3 Каталог parameters - товар, (категория, название, описание, цена, фото)
        parameters = [get_category(apps, "Салаты"), "Салат кобб с лососем", """Салат с запеченным лососем, брокколи, картофелем, каперсами, томатными черри, редисом и с яйцом в крутую, подается с цитрусовым майонезом.""", 4250, "images/catalog03.jpg"]		
        insert_catalog(apps, parameters)   
        parameters = [datetime.now() - timedelta(days=28) + timedelta(minutes=random.randint(1, 240)), 3, 5, 5, "Вкусный, оригинальный состав"]		
        insert_review(apps, parameters) 
        #parameters = [datetime.now() - timedelta(days=27) + timedelta(minutes=random.randint(1, 240)), 3, 6, "Вопрос", "Ответ"]		
        #insert_question(apps, parameters) 

        #4 Каталог parameters - товар, (категория, название, описание, цена, фото)
        parameters = [get_category(apps, "Салаты"), "Хрустящие баклажаны с томатами", """Баклажан, томаты, кинза, соус свит Чили, кунжутные семечки""", 2150, "images/catalog04.jpg"]		
        insert_catalog(apps, parameters)   
        parameters = [datetime.now() - timedelta(days=27) + timedelta(minutes=random.randint(1, 240)), 4, 6, 5, "Качество, вкус!"]		
        insert_review(apps, parameters) 
        #parameters = [datetime.now() - timedelta(days=26) + timedelta(minutes=random.randint(1, 240)), 4, 7, "Вопрос", "Ответ"]		
        #insert_question(apps, parameters) 

        #5 Каталог parameters - товар, (категория, название, описание, цена, фото)
        parameters = [get_category(apps, "Салаты"), "Салат боул", """Авокадо, соус медово горчичный,  салат руколла, редис, брокколи отварное яйца, куриное филе, куриное филе обжаренное,  соус песто""", 3950, "images/catalog05.jpg"]		
        insert_catalog(apps, parameters)   
        parameters = [datetime.now() - timedelta(days=29) + timedelta(minutes=random.randint(1, 240)), 5, 7, 5, "Насколько это вкусное блюдо невозможно передать словами!!!! Этот салат надо есть!"]		
        insert_review(apps, parameters) 
        #parameters = [datetime.now() - timedelta(days=25) + timedelta(minutes=random.randint(1, 240)), 5, 8, "Вопрос", "Ответ"]		
        #insert_question(apps, parameters) 

        #6 Каталог parameters - товар, (категория, название, описание, цена, фото)
        parameters = [get_category(apps, "Супы"), "Борщ", """Говяжий бульон, белокачанная капуста, репчатый лук, свекла, морковь, томатная паста, чеснок, говядина, зелень, сметана, чесночные пампушки""", 2050, "images/catalog06.jpg"]		
        insert_catalog(apps, parameters)   
        parameters = [datetime.now() - timedelta(days=25) + timedelta(minutes=random.randint(1, 240)), 6, 8, 5, "Вкусный, наваристый и, при этом, сохранивший цвет всегда был в почете во многих семьях."]		
        insert_review(apps, parameters) 
        #parameters = [datetime.now() - timedelta(days=24) + timedelta(minutes=random.randint(1, 240)), 6, 9, "Вопрос", "Ответ"]		
        #insert_question(apps, parameters) 

        #7 Каталог parameters - товар, (категория, название, описание, цена, фото)
        parameters = [get_category(apps, "Супы"), "Чечевичный суп", """Чечевица, лук, морковь, чипсы из базилика""", 1550, "images/catalog07.jpg"]		
        insert_catalog(apps, parameters)   
        parameters = [datetime.now() - timedelta(days=24) + timedelta(minutes=random.randint(1, 240)), 7, 9, 5, "Вкусно, качественный продукт"]		
        insert_review(apps, parameters) 
        #parameters = [datetime.now() - timedelta(days=23) + timedelta(minutes=random.randint(1, 240)), 7, 10, "Вопрос", "Ответ"]		
        #insert_question(apps, parameters) 

        #8 Каталог parameters - товар, (категория, название, описание, цена, фото)
        parameters = [get_category(apps, "Супы"), "Сорпа из баранины", """Бульон из баранины с овощами. Филе баранины, картофель, болгарский перец, кинза""", 2450, "images/catalog08.jpg"]		
        insert_catalog(apps, parameters)   
        parameters = [datetime.now() - timedelta(days=23) + timedelta(minutes=random.randint(1, 240)), 8, 10, 5, "Просто объедениеЙ"]		
        insert_review(apps, parameters) 
        #parameters = [datetime.now() - timedelta(days=22) + timedelta(minutes=random.randint(1, 240)), 8, 11, "Вопрос", "Ответ"]		
        #insert_question(apps, parameters) 

        #9 Каталог parameters - товар, (категория, название, описание, цена, фото)
        parameters = [get_category(apps, "Супы"), "Паназиатский суп", """Рыбный бульон, семга, креветки тигровые, яйцо, соус Ширача, соевый соус, нори (водоросли), кокосовое масло, свежие огурцы, помидор, кунжутные семечки, кинза свежая""", 2750, "images/catalog09.jpg"]		
        insert_catalog(apps, parameters)   
        parameters = [datetime.now() - timedelta(days=22) + timedelta(minutes=random.randint(1, 240)), 9, 11, 5, "нежный, вкусный, с идеальным составом"]		
        insert_review(apps, parameters) 
        #parameters = [datetime.now() - timedelta(days=21) + timedelta(minutes=random.randint(1, 240)), 9, 12, "Вопрос", "Ответ"]		
        #insert_question(apps, parameters) 

        #10 Каталог parameters - товар, (категория, название, описание, цена, фото)
        parameters = [get_category(apps, "Супы"), "Окрошка", """Кефир,картофель, яйцо, морковь, редис, огурец, петрушка, горчица, индейка, лимон, масло оливковое, перепелиное яйцо""", 2050, "images/catalog10.jpg"]		
        insert_catalog(apps, parameters)   
        parameters = [datetime.now() - timedelta(days=20) + timedelta(minutes=random.randint(1, 240)), 10, 12, 5, "Вкус, аромат!"]		
        insert_review(apps, parameters) 
        #parameters = [datetime.now() - timedelta(days=19) + timedelta(minutes=random.randint(1, 240)), 10, 13, "Вопрос", "Ответ"]		
        #insert_question(apps, parameters) 

        #11 Каталог parameters - товар, (категория, название, описание, цена, фото)
        parameters = [get_category(apps, "Вторые блюда"), "Утиная ножка", """Утиная ножка, гречка, яблоко, соус Демиглас, соус Терияки, масло сливочное.""", 6350, "images/catalog11.jpg"]		
        insert_catalog(apps, parameters)   
        parameters = [datetime.now() - timedelta(days=19) + timedelta(minutes=random.randint(1, 240)), 11, 13, 5, "Качество; свежесть; вкус; аромат"]		
        insert_review(apps, parameters) 
        #parameters = [datetime.now() - timedelta(days=18) + timedelta(minutes=random.randint(1, 240)), 11, 14, "Вопрос", "Ответ"]		
        #insert_question(apps, parameters) 

        #12 Каталог parameters - товар, (категория, название, описание, цена, фото)
        parameters = [get_category(apps, "Вторые блюда"), "Котлеты по Киевский", """Куриная котлета, картофельное пюре, масло сливочное, масло трюфельное, яйцо, сухари, зелень.""", 3050, "images/catalog12.jpg"]		
        insert_catalog(apps, parameters)   
        parameters = [datetime.now() - timedelta(days=18) + timedelta(minutes=random.randint(1, 240)), 12, 14, 5, "Натуральный состав, котлеты сочные, нежные и вкусные."]		
        insert_review(apps, parameters) 
        #parameters = [datetime.now() - timedelta(days=17) + timedelta(minutes=random.randint(1, 240)), 12, 15, "Вопрос", "Ответ"]		
        #insert_question(apps, parameters) 

        #13 Каталог parameters - товар, (категория, название, описание, цена, фото)
        parameters = [get_category(apps, "Вторые блюда"), "Мясо гриль с молодой телятиной и овощами", """Мясо говядина, овощи гриль""", 4050, "images/catalog13.jpg"]		
        insert_catalog(apps, parameters)   
        parameters = [datetime.now() - timedelta(days=17) + timedelta(minutes=random.randint(1, 240)), 13, 15, 5, "Вкусное, интересное блюдо"]		
        insert_review(apps, parameters) 
        #parameters = [datetime.now() - timedelta(days=16) + timedelta(minutes=random.randint(1, 240)), 13, 16, "Вопрос", "Ответ"]		
        #insert_question(apps, parameters) 

        #14 Каталог parameters - товар, (категория, название, описание, цена, фото)
        parameters = [get_category(apps, "Вторые блюда"), "Бефстроганов", """Минутка телятины, сливки, сметана, лук, шампиньоны, чеснок, раст масло, картофельное пюре""", 3050, "images/catalog14.jpg"]		
        insert_catalog(apps, parameters)   
        parameters = [datetime.now() - timedelta(days=16) + timedelta(minutes=random.randint(1, 240)), 14, 16, 5, "Свежее, вкусное мясо"]		
        insert_review(apps, parameters) 
        #parameters = [datetime.now() - timedelta(days=15) + timedelta(minutes=random.randint(1, 240)), 14, 17, "Вопрос", "Ответ"]		
        #insert_question(apps, parameters) 

        #15 Каталог parameters - товар, (категория, название, описание, цена, фото)
        parameters = [get_category(apps, "Вторые блюда"), "Домашняя отбивная из курицы", """Куриное филе, панировка (мука, яйца, сухари) шпинат, огурцы, редис, микс из семечек, соус барбекю""", 3350, "images/catalog15.jpg"]		
        insert_catalog(apps, parameters)   
        parameters = [datetime.now() - timedelta(days=15) + timedelta(minutes=random.randint(1, 240)), 15, 17, 5, "Нежное, сочное мясо!"]		
        insert_review(apps, parameters) 
        #parameters = [datetime.now() - timedelta(days=14) + timedelta(minutes=random.randint(1, 240)), 15, 18, "Вопрос", "Ответ"]		
        #insert_question(apps, parameters) 

        #16 Каталог parameters - товар, (категория, название, описание, цена, фото)
        parameters = [get_category(apps, "Напитки"), "Чай Марокканский", """Чай зеленый, лимон, корица, анис, мята. Класический марроканский чай в новой формации. Добавление гранатового сиропа придает этому чаю нотки сладости""", 1000, "images/catalog16.jpg"]		
        insert_catalog(apps, parameters)   
        parameters = [datetime.now() - timedelta(days=14) + timedelta(minutes=random.randint(1, 240)), 16, 18, 5, "Вкус, аромат мяты!"]		
        insert_review(apps, parameters) 
        #parameters = [datetime.now() - timedelta(days=13) + timedelta(minutes=random.randint(1, 240)), 16, 19, "Вопрос", "Ответ"]		
        #insert_question(apps, parameters) 

        #17 Каталог parameters - товар, (категория, название, описание, цена, фото)
        parameters = [get_category(apps, "Напитки"), "Чай Облепиховый", """Облепиха, сок лимона-30. Облепиха известна своими лечебными свойствами, не зря ее испльзуют в медицине. Мы делаем из нее очень вкусный и полезный чай""", 1000, "images/catalog17.jpg"]		
        insert_catalog(apps, parameters)   
        parameters = [datetime.now() - timedelta(days=13) + timedelta(minutes=random.randint(1, 240)), 17, 19, 5, "Вкусный и полезный"]		
        insert_review(apps, parameters) 
        #parameters = [datetime.now() - timedelta(days=12) + timedelta(minutes=random.randint(1, 240)), 17, 20, "Вопрос", "Ответ"]		
        #insert_question(apps, parameters) 

        #18 Каталог parameters - товар, (категория, название, описание, цена, фото)
        parameters = [get_category(apps, "Напитки"), "Чай Каркаде", """Чайный напиток из лепестков гибискуса""", 650, "images/catalog18.jpg"]		
        insert_catalog(apps, parameters)   
        parameters = [datetime.now() - timedelta(days=12) + timedelta(minutes=random.randint(1, 240)), 18, 20, 5, "Достоинства: Насыщенный вкус с вишневой кислинкой."]		
        insert_review(apps, parameters) 
        #parameters = [datetime.now() - timedelta(days=11) + timedelta(minutes=random.randint(1, 240)), 18, 21, "Вопрос", "Ответ"]		
        #insert_question(apps, parameters) 

        #19 Каталог parameters - товар, (категория, название, описание, цена, фото)
        parameters = [get_category(apps, "Напитки"), "Айс кофе Бамблби", """Сироп карамель, сок апельсина, сок персика, эспрессо""", 1200, "images/catalog19.jpg"]		
        insert_catalog(apps, parameters)   
        parameters = [datetime.now() - timedelta(days=11) + timedelta(minutes=random.randint(1, 240)), 19, 21, 5, "Достоинства: вкусно,интересно"]		
        insert_review(apps, parameters) 
        #parameters = [datetime.now() - timedelta(days=10) + timedelta(minutes=random.randint(1, 240)), 19, 22, "Вопрос", "Ответ"]		
        #insert_question(apps, parameters) 

        #20 Каталог parameters - товар, (категория, название, описание, цена, фото)
        parameters = [get_category(apps, "Напитки"), "Айс кофе Эспрессо тоник", """Сироп в ассортименте, тоник, 1 шот эспрессо""", 1800, "images/catalog20.jpg"]		
        insert_catalog(apps, parameters)   
        parameters = [datetime.now() - timedelta(days=10) + timedelta(minutes=random.randint(1, 240)), 20, 22, 5, "Отличный напиток, рекомендую!"]		
        insert_review(apps, parameters) 
        #parameters = [datetime.now() - timedelta(days=9) + timedelta(minutes=random.randint(1, 240)), 20, 3, "Вопрос", "Ответ"]		
        #insert_question(apps, parameters) 

        #Новости
        #parameters = [datetime.now() - timedelta(days=10) + timedelta(minutes=random.randint(1, 240)), "Заголовок", """Детали""", "images/news1.jpg" ]
        #insert_news(apps, parameters)
        parameters = [datetime.now() - timedelta(days=10) + timedelta(minutes=random.randint(1, 240)), "Кафе начали запрещать приходить с детьми в Южной Корее", """Южная Корея столкнулась с появлением заведений, где не приветствуются гости с маленькими детьми. По последним данным Исследовательского института Чеджу, в стране их насчитывается уже 542. Многие из таких мест являются частными предприятиями, включая кафе, рестораны, даже Национальную библиотеку Кореи
Распознать заведения с No Kids Zone нетрудно: на дверях таких мест обычно висит табличка или специальный знак. Причины распространения таких заведений предприниматели приводят самые разные. Одни кафе и рестораны опасаются, что дети будут мешать посетителям, в то время как другие утверждают, что это связано с безопасностью и предотвращением порчи имущества. Бывали и случаи, когда предприятия привлекались к ответственности за травмы, полученные детьми в их помещениях. Возможно, это некая мера борьбы с молодыми родителями, которые не могут должным образом контролировать поведение своих детей.
одители обеспокоены стремительным ростом числа подобных заведений. Они убеждены, что такими темпами дети не смогут социализироваться и не научатся вести себя в обществе, так как им попросту там не рады. В Южной Корее самый низкий уровень рождаемости в мире, а зарождение такой тенденции лишь подкрепит нежелание корейцев заводить детей, заявляют противники тренда.""", "images/news1.jpg" ]
        insert_news(apps, parameters)
        parameters = [datetime.now() - timedelta(days=9) + timedelta(minutes=random.randint(1, 240)), "Самый лучший официант: во Франции прошел необычный марафон", """Парижские официанты доказали, что могут запоминать заказы восьми человек без записи заметок. Могут очень быстро принести завтрак и напитки за один раз и еще найти время для перекура. Все это благодаря марафону в Париже, где гарсоны показали свои таланты
        В Париже возродили Course des Cafés – марафон, на котором официантам предлагается пройти 2-километровый маршрут с подносами, груженными круассаном, стаканом воды и маленькой чашкой кофе.
        Отмечается, что разрешена только быстрая ходьба, а не бег. Очки начисляют за скорость, но на финише судьи могут отнять их, если жидкости разлились на поднос.
        По сообщению СМИ, 200 официантов городских кафе вышли в центр Парижа в классической черно-белой форме. Они стартовали у мэрии, далее направились в Помпиду и прошли узкие улицы Маре. Это первый подобный марафон за 13 лет, в течение которых он не проводился в связи с отсутствием финансирования.""", "images/news2.jpg" ]
        insert_news(apps, parameters)
        parameters = [datetime.now() - timedelta(days=8) + timedelta(minutes=random.randint(1, 240)), "От джаза до рока. Популярные среди туристов музкафе Алматы", """Алматы является эпицентром казахстанской культуры в целом и музыки в частности. Здесь творили именитые казахстанские композиторы, создавались первые музыкальные театры, формировались первые казахстанские эстрадные ансамбли. С 1990 года на высокогорном спорткомплексе "Медеу" проводится уникальный международный музыкальный фестиваль "Азия Дауысы".
        Музкафе
Адрес: пр. Абая, 117, уг. ул. Клочкова.
Живые выступления в двух залах этого кафе проходят практически каждый день. В репертуаре джаз, трибьют концерты мировых звезд и акустическая музыка. В основном упор делается на выступления алматинских групп, но бывают и зарубежные гости
Джаз-клуб EverJazz
Адрес: ул. Зенкова, 24.
Является первым профессиональным джаз-клубом в Алматы. В репертуаре джаз, босанова, фанк, блюз, соул и фламенко. Основу музыкальной программы клуба составляют музыканты казахстанской и российской школы джаза, однако нередко выступают и звезды мировой сцены.
Harat's Pub на Панфилова
Адрес: ул. Панфилова, 110 (между ул. Богенбай батыра, Карасай Батыра).
Это классический ирландский паб, в котором выступают казахстанские исполнители в жанрах от гранжа до рок-н-ролла.""", "images/news3.jpg" ]
        insert_news(apps, parameters)
        parameters = [datetime.now() - timedelta(days=7) + timedelta(minutes=random.randint(1, 240)), "Необычное кафе заработало в Актау", """В Актау заработало социальное кафе, где поварами, официантами и администраторами работают люди с особыми потребностями
Большую часть персонала составляют слабослышащие с рождения. Сотрудники прошли специальное обучение, поэтому посетителям, чтобы сделать заказ, необязательно владеть языком жестов.
"Первое, на что мы обращаем внимание, приходя сюда утром на работу, - это чистота. Мне нравится здесь. Каждый сотрудник несет ответственность за свою работу", - говорит сурдопереводчик Ардак Жаксылыкова.""", "images/news4.jpg" ]
        insert_news(apps, parameters)
        parameters = [datetime.now() - timedelta(days=6) + timedelta(minutes=random.randint(1, 240)), "Еще на 10 процентов планируют повысить цены в кафе и ресторанах Казахстана", """По данным Бюро национальной статистики, за год цены в казахстанских кафе и ресторанах выросли сразу на 25 процентов. Владельцы общепита обещают снова переписать ценники из-за стремительного подорожания продуктов и необходимости повышать зарплату сотрудникам. 
        "Основные статьи расходов - это у нас в первую очередь закуп продуктов, зарплата сотрудников и арендные, коммунальные платежи. Естественно, сейчас продукты подорожали минимум на 30-50 процентов. Мясо много где у нас. Практически во всех продуктах, во всех наименованиях меню есть мясо", - пояснила учредитель Ассоциации общественного питания Сулушаш Туякова.
По ее словам, учитывая темпы инфляции, цены в заведениях общепита могут повысить еще на 10 процентов.
Накануне Президент Казахстана Касым-Жомарт Токаев назвал рост цен на продовольствие небывалым за последние 15 лет. В феврале инфляция достигла своего годового пика, превысив 21 процент. Сейчас люди тратят на продукты больше половины ежемесячного дохода.""", "images/news5.jpg" ]
        insert_news(apps, parameters)
        print("Созданы Новости")

    except Exception as error:
        print(error)

class Migration(migrations.Migration):

    dependencies = [
        ('product', '0001_initial'),
    ]

    operations = [
        migrations.RunPython(new_data),
        migrations.RunSQL("""CREATE VIEW view_catalog AS
SELECT catalog.id, catalog.category_id, category.category_title AS category, catalog.catalog_title, catalog.details, catalog.price, catalog.photo, 
(SELECT AVG(rating) FROM review WHERE review.catalog_id = catalog.id) AS avg_rating
FROM catalog LEFT JOIN category ON catalog.category_id = category.id;"""),

    ]
